/**
 * *****************************************************************************
 * @file        dac.h
 * @brief       dac底层驱动
 * @author      caoyang
 * @date        2023-11-13
 * @copyright   欢阳技有限公司
 * *****************************************************************************
 */

#ifndef DAC_H 
#define DAC_H 
/*----------------------------------include-----------------------------------*/
#include "stm32f4xx.h"
#include "stm32f4xx_dac.h"
#include "stm32f4xx_gpio.h"
#include "stm32f4xx_rcc.h"
/*-----------------------------------macro------------------------------------*/
//DAC输出GPIO
#define DBG_DAC_CH1_Pin GPIO_Pin_4
#define DBG_DAC_CH1_GPIO_Port GPIOA
#define DBG_DAC_CH2_Pin GPIO_Pin_5
#define DBG_DAC_CH2_GPIO_Port GPIOA

/*----------------------------------typedef-----------------------------------*/

/*----------------------------------variable----------------------------------*/

/*-------------------------------------os-------------------------------------*/

/*----------------------------------function----------------------------------*/
void dac_init(void);
void dac_output_data(uint16_t data1,uint16_t data2);
/*------------------------------------test------------------------------------*/

#endif	/* DAC_H */







